Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཚིམ་པར་བྱེད་པའི་མཆོད་པའི་སྤྲིན་ཆེན་པོར་འགྱུར་རོ།
en: Large offerings will manifest to satisfy all the tathāgatas.

source: །འདི་ལྟ་སྟེ་ལྷ་རྫས་ཀྱི་རོལ་མོའི་སྒྲ་རྣམ་པ་སྣ་ཚོགས་པ། དགའ་བར་འོས་པའི་རོལ་མོའི་ཕེག་རྡོབ་པ་རྣམས་དང་། འདི་ལྟ་སྟེ། དབྱངས་ཀྱི་ཡན་ལག་ལྔ་དང་ལྡན་པའི་མིའམ་ཅི་དང་།
en: They will include the pleasant sounds of celestial music using the five notes and played with various instruments to the rhythm of drums.

source: དྲི་ཟའི་གླུ་དབྱངས་རྣམ་པ་སྣ་ཚོགས་པ་དང་བཅས་པ་དང་། ཀླུའི་བུ་མོ་དང་། ལྷ་མ་ཡིན་གྱི་བུ་མོ་དང་། ལྷའི་བུ་མོ་དང་།
en: The vocals will be provided by female kinnaras and gandharvas, with female nāgas, asuras, devas, and apsarases singing along.

source: ཆུ་ལས་བྱུང་བའི་བུ་མོ་རྣམས་ཀྱིས་རྣམ་པ་ཐ་དད་རྣམ་པ་སྣ་ཚོགས་པའི་གསང་སྔགས་ཀྱི་གླུ་དབྱངས་ཀྱི་རོལ་མོའི་སྒྲ་རབ་ཏུ་འཁྲོལ་བཞིན་པ་རྣམས་ཀྱིས་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་དེ་རྣམས་ཐམས་ཅད་ཀྱི་དུས་གསུམ་པའི་རོལ་མོ་ཆེན་པོའི་མཆོད་པའི་སྤྲིན་དུ་འགྱུར་རོ།
en: They will sing in different voices and play various instruments. All these great sounds will be presented as an offering to all the tathāgatas of the three times and in the ten directions, who will be praised in various hymns of praise performed for them.

source: །རྣམ་པ་སྣ་ཚོགས་པར་མཛེས་པའི་བསྟོད་པའི་རྣམ་པས་རོལ་མོའི་ཆོ་ག་ཞིབ་མོ་ཇི་ལྟ་བ་བཞིན་དུ་གསང་བའི་ཕྱག་རྒྱ་དང་། དཀྱིལ་འཁོར་གྱི་རིམ་པར་ཕྱེ་བ་དང་། རྗེས་སུ་མཐུན་པས་ཡང་དག་པར་བསྟོད་པར་འགྱུར་རོ།
en: They will be praised along with the secret rites, mudrās, and maṇḍalas in the right order.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དང་བཅས་པའི་རིག་སྔགས་ཀྱི་ལྷ་དང་། དཀྱིལ་འཁོར་གྱི་ལྷས་རྗེས་སུ་འཛིན་པར་འགྱུར་རོ། །ཡང་དག་པར་བསྟོད་པ་རྣམས་ཀྱང་མཚན་སྨོས་པས་ཡང་དག་པར་བསྟོད་པ་བྱས་པར་འགྱུར་རོ།
en: Included in the praise will be the bodhisattvas, vidyā deities, and maṇḍala deities, whose names will be mentioned and praised. “

source: །དེ་བཞིན་དུ་ཡངས་པ་དང་ལྡན་པའི་གཟུངས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་གསུངས་པ།
en: Thus, the dhāraṇī taught by Noble Avalokiteśvara is very important.

source: མཆོག་ཐམས་ཅད་དུ་མཆོད་པའི་སྤྲིན་དུ་གྱུར་པ།
en: It grants every boon and conjures up masses of all kinds of offerings.

source: བླ་ན་མེད་པ་དཔག་བསམ་གྱི་ཤིང་ལྟ་བུའོ།
en: It is like the supreme wish-fulfilling tree.

source: །སྣ་ཚོགས་པའི་རྫུ་འཕྲུལ་དང་རྣམ་པར་འཕྲུལ་པ་སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་བྱིན་གྱིས་རློབ་པའི་རྣམ་པར་འཕྲུལ་པས་རིག་སྔགས་འཆང་ཐམས་ཅད་ཀྱི་རྨད་དུ་བྱུང་བའི་མཆོག་གི་དངོས་གྲུབ་སྟེར་བར་བྱེད་པའོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་མ་དང་ཕར་གྱུར་པའོ།
en: It produces the illusion-like samādhi with its various magical powers and abilities, and it confers special blessings upon all the vidyā holders, to whom it grants supreme and wonderful accomplishment.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡང་དག་པར་གྱུར་པའོ།
en: It is like the mother and father to all beings, fulfilling all their wishes.

source: །གསང་སྔགས་འཛིན་པ་ཐམས་ཅད་ཀྱི་མཆོག་གི་དངོས་གྲུབ་དང་། བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ།
en: It grants the supreme accomplishment to all mantra practitioners and fulfils all their wishes.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡིག་པ་དང་། ཉོན་མོངས་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པའོ།
en: It completely purifies the negativities, afflictions, and obscurations of all beings.

source: །ནད་ཐམས་ཅད་སེལ་བར་བྱེད་པའོ། །སྡུག་བསྔལ་མི་བཟད་པ་གདུག་པ་ཐམས་ཅད་འཇོམས་པར་བྱེད་པའོ། །བཀྲ་ཤིས་པ་དང་།
en: It eradicates all disease and terrible suffering.

source: ཡིད་ཀྱི་ཤིང་རྟ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡང་དག་པར་སྐུལ་བར་བྱེད་པའོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དབུགས་འབྱིན་པར་བྱེད་པའོ།
en: It destroys all crime, fulfills every benevolent wish, spurs all tathāgatas into action, and brings relief to all the bodhisattvas. “

source: །རིག་སྔགས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ལྷ་ཐམས་ཅད་སྤྱན་འདྲེན་པར་བྱེད་པའོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་དཀྱིལ་འཁོར་རྣམས་སྟོན་པར་བྱེད་པའོ། །ཀླུ་ཐམས་ཅད་འགུགས་པར་བྱེད་པའོ། །གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་།
en: This dhāraṇī summons all the vidyā deities of the maṇḍala and reveals the secret maṇḍalas of all the tathāgatas.

source: འབྱུང་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། བགེགས་དང་། ལོག་པར་འདྲེན་པ་ཐམས་ཅད་ལྡོག་པར་བྱེད་པའོ།
en: It attracts and summons all nāgas and subdues all yakṣas, rākṣasas, bhūtas, pretas, piśācas, vighnas, and vināyakas.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོག་གི་དངོས་གྲུབ་སྦྱིན་པར་བྱེད་པའོ།
en: It grants all beings supreme accomplishment.

source: །དབུགས་མ་ཕྱིན་པ་རྣམས་ཀྱི་དབུགས་འབྱིན་པར་བྱེད་པའོ། །མ་གྲོལ་བ་རྣམས་གྲོལ་བར་བྱེད་པའོ། །སྐྱབས་མེད་པ་རྣམས་ཀྱི་སྐྱབས་སོ། །དཔུང་གཉེན་མེད་པ་རྣམས་ཀྱི་དཔུང་གཉེན་ནོ།
en: It consoles the disconsolate, liberates those not liberated, is a refuge for those without refuge, and gives purpose to those without a purpose.

source: །མགོན་མེད་པ་རྣམས་ཀྱི་མགོན་དུ་གྱུར་པའོ། །འཁྲ་ས་མེད་པ་རྣམས་ཀྱི་འཁྲ་སའོ། །བསྙེན་གནས་མ་བྱས་པ་རྣམས་ལ་བསྙེན་གནས་སྦྱིན་པའོ།
en: It is the protector of those without a protector, and it gives direction to those without a direction.

source: །གཙང་སྦྲ་མ་བྱས་པ་རྣམས་ལ་གཙང་སྦྲར་སྤྱོད་པའོ། །མི་ཚངས་པར་སྤྱོད་པའི་གནས་ལ་ཞེན་པ་རྣམས་ལ་ཚངས་པར་སྤྱོད་པའི་གནས་སྦྱིན་པའོ། །ཐུབ་པའི་བརྟུལ་ཞུགས་མ་བྱས་པ་རྣམས་ལ་ཐུབ་པའི་བརྟུལ་ཞུགས་སྦྱིན་པའོ། །ཆོས་མ་ཡིན་པ་ལ་སྤྱོད་པ་རྣམས་ཆོས་ལ་སྦྱོར་བའོ།
en: It induces those who are not fasting to take up fasting, purifies the conduct of those who are not pure, and induces those who are not celibate and keep a lover to take a vow of chastity and not take a lover.

source: །མི་དགེ་བའི་ལས་ཀྱི་ལམ་ལ་སྤྱོད་པ་རྣམས་དགེ་བའི་ཆོས་ལ་སྦྱོར་བའོ།
en: It makes those without a vow of silence take the vow of silence, induces those who do not practice the Dharma to practice it, and causes those who habitually commit unwholesome acts to mend their ways and follow the path of virtue. “

source: །འཇིགས་པས་ཉམ་ཐག་པ་རྣམས་ལ་མི་འཇིགས་པ་སྦྱིན་པའོ། །དབུལ་པོ་རྣམས་ལ་ནོར་སྦྱིན་པའོ། །འབྲུ་དང་བཟའ་བ་དང་བྲལ་བ་རྣམས་ལ་འབྲུ་འཕེལ་བ་ཆེན་པོ་སྦྱིན་པའོ། །མུ་གེས་ཉམས་ཐག་པ་རྣམས་ལ་སྐྱ་རྒྱལ་གྱི་ཚོགས་པ་ལ་ངེས་པར་སྦྱོར་བར་བྱེད་པའོ།
en: This dhāraṇī gives fearlessness to the frightened, grants wealth to the poor, increases the stores of grain of those without any, and gives all needed supplies to those affected by famine.

source: །ལམ་ཉམས་པ་རྣམས་ཀྱི་ལམ་སྟོན་པར་བྱེད་པའོ། །དུས་མ་ཡིན་པར་འཆི་བར་འགྱུར་བ་རྣམས་ཀྱི་དུས་མ་ཡིན་པའི་འཆི་བ་སོ་སོར་འགོག་པའོ།
en: It shows the way to those who have lost it, and it prevents the untimely death of those whose lives would otherwise be cut short.

source: །ལོང་བ་རྣམས་ཀྱི་མིག་སྦྱིན་པར་བྱེད་པའོ། །འོན་པ་རྣམས་རྣ་བ་སྦྱིན་པར་བྱེད་པའོ། །སྣ་ཉམས་པ་རྣམས་ཀྱི་སྣ་རྣམ་པར་སྦྱོང་བར་བྱེད་པའོ། །རེག་པ་མེད་པ་རྣམས་ཀྱི་བདེ་བའི་རེག་པ་ལ་ངེས་པར་སྦྱོར་བར་བྱེད་པའོ།
en: It grants vision to the blind, restores hearing in the deaf, restores the sense of smell to the anosmic, and swiftly restores the sense of touch to those who have lost it.

source: །ལོངས་སྤྱོད་ཀྱིས་ཉམ་ཐག་པ་རྣམས་ཀྱི་ལོངས་སྤྱོད་སྦྱིན་པར་བྱེད་པའོ།
en: It restores the ability to enjoy what one has cruelly lost.

source: །དྲན་པ་ཉམས་པ་རྣམས་ཀྱི་དྲན་པ་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པའོ། །བསམ་པ་ཉམས་པ་རྣམས་ཀྱི་བསམ་པ་ཡོངས་སུ་དག་པར་བྱེད་པའོ། །ཚུལ་ཁྲིམས་ཉམས་པ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་སྦྱིན་པའོ།
en: It restores memory in those suffering from amnesia, and sanity to those who have lost their mind. “

source: །སྦྱིན་པ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་རྣམས་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །བརྩོན་འགྲུས་ཉམས་པ་རྣམས་ལ་སྟོབས་དང་བརྩོན་འགྲུས་ཀྱི་མཆོག་སྦྱིན་པའོ། །བཟོད་པ་དང་བྲལ་བ་རྣམས་ལ་བཟོད་པ་དང་ཞི་བ་སྦྱིན་པའོ། །བསམ་གཏན་ཉམས་པ་རྣམས་ལ་བསམ་གཏན་དང་ཏིང་ངེ་འཛིན་ནི་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །ཤེས་རབ་ཉམས་པ་རྣམས་ལ་ཤེས་རབ་ཀུན་ཏུ་སྣང་བ་དང་། བློ་གསལ་བ་དང་། ཤེས་རབ་ཆེན་པོའི་སྣང་བ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: This dhāraṇī grants discipline to those without it, fulfills the six perfections for those who shy away from generosity, grants supreme energy and strength to those who have lost them, grants patience and forbearance to those without them, grants meditative concentration to those who lack it, and brings the light of insight to those devoid of insight, giving them a lucid intellect and clear insight.

source: །དམ་ཚིག་མི་ཤེས་པ་རྣམས་ལ་དམ་ཚིག་སྦྱིན་པའོ། །ཕྱག་རྒྱ་དང་བྲལ་བ་རྣམས་ཀྱི་ཕྱག་རྒྱ་ཡོངས་སུ་སྦྱོར་བར་བྱེད་པའོ། །རིག་སྔགས་དང་། གསང་སྔགས་ལ་མི་མཁས་པ་རྣམས་ལ་རིག་སྔགས་དང་གསང་སྔགས་རབ་ཏུ་སྦྱིན་པའོ། །མུ་སྟེགས་རྣམས་ལ་མུ་སྟེགས་སྨྲ་བ་དང་།
en: It gives samaya to those who do not know the samaya, and it restores mudrās to those without them, and the efficacy of the vidyā mantras to those who have lost it. “

source: འཇུག་ངོགས་བཟང་པོ་དང་ལམ་རབ་ཏུ་སྒྲུབ་པར་བྱེད་པའོ།
en: This dhāraṇī causes the followers of other religions to develop appreciation for religious paths that are auspicious.

source: །སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་རྣམས་ལ། སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཆེན་པོ་མཆོག་སྦྱིན་པའོ།
en: It grants the supreme realization of a buddha, even to those who turn away from it.

source: །འཁོར་བ་ལས་མ་བསྒྲལ་བ་རྣམས་སྒྲོལ་བར་བྱེད་པའོ།
en: It causes those who have not crossed saṃsāra to cross it.

source: །མུན་པས་ལོང་བར་བྱེད་ཅིང་བསྒྲིབས་པ་རྣམས་ལ། མྱོས་པའི་མུན་པ་སེལ་བ་སྦྱིན་པར་བྱེད་པའོ། །སྒྲིབ་པར་བྱ་བ་རྣམས་ཀྱི་སྒྲིབ་པ་དང་བྲལ་བར་བྱེད་པའོ།
en: It grants those steeped in darkness the means to dispel the darkness of their delusion, and it removes the mental blindness of those obscured by it.

source: །མཚམས་མེད་པ་ལྔའི་འགྲོ་བ་རྣམས་ཀྱི་མཚམས་མེད་པ་ལྔ་སྦྱོང་བར་བྱེད་པའོ། །ངག་ཉམས་པ་རྣམས་ཀྱི་ངག་རྣམ་པར་དག་པར་བྱེད་པའོ། །མ་གྲུབ་པ་རྣམས་ལ་མཆོག་གི་དངོས་གྲུབ་སྦྱིན་པའོ།
en: It purifies the five acts of immediate retribution in those who follow the destinies consistent with committing these acts, restores the faculty of speech in those who have lost it, and grants the supreme accomplishment to those without accomplishment.

source: །ཐུན་ཚགས་དང་བཅས་པ་རྣམས་ཀྱི་ཐུན་ཚགས་དང་བྲལ་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་པའོ། །ངན་པ་རྣམས་ལ་མཆོག་སྦྱིན་པའོ།
en: It purifies the moral stains of those who are morally stained, and it grants supreme bliss to those who are despised. “

source: །མྱ་ངན་ལས་མ་འདས་པ་རྣམས་ཀྱི་མྱ་ངན་ལས་འདས་པའི་མཆོག་གོ།
en: This dhāraṇī grants final nirvāṇa to those who have not yet attained it and prophesies the awakening of those who have not received that prophecy.

source: །བརྡ་མི་ཕྲད་པ་རྣམས་ལ་བརྡ་སྤྲོད་པར་བྱེད་པའོ། །ཀུན་ནས་འཁྲུགས་པ་རྣམས་ཀྱི་སེམས་གནས་པའི་མཆོག་གོ། །མཆོག་མེད་པ་རྣམས་ལ་མཆོག་སྦྱིན་པའོ། །རྨི་ལམ་ངན་པ་མཐོང་བ་རྣམས་ལ་རྨི་ལམ་ཆེན་པོའི་མཆོག་སྟོན་པའོ། །བཀྲེས་པ་རྣམས་ལ་ཁ་ཟས་ཀྱི་མཆོག་སྦྱིན་པའོ།
en: It allows those who are confused to attain supreme presence of mind, grants boons to those who have not received them, and sends great dreams to those who suffer from nightmares.

source: །སྐོམ་པ་རྣམས་བཏུང་བ་ཆེན་པོའི་རོ་ལ་ཡོངས་སུ་ལོངས་སྤྱོད་པར་བྱེད་པའོ། །གཅེར་བུ་རྣམས་ཀྱིས་གོས་དང་བགོ་བ་སོ་སོར་ཐོབ་ཅིང་གྲུབ་པའོ།
en: It provides excellent food to the hungry, flavorful beverages to the thirsty, and various garments and cloaks to the naked. It grants them success.

source: །མཛེ་ཅན་རྣམས་ཀྱི་མཛེ་དང་བྲལ་བར་བྱེད་པའོ།
en: It removes lesions from those suffering from leprosy, and the white patches from those suffering from white leprosy.

source: །ཤ་བཀྲ་ཅན་རྣམས་ཀྱི་ཤ་བཀྲ་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པའོ། །རིམས་ཀྱིས་བཏབ་པ་རྣམས་ཀྱི་རིམས་དང་བྲལ་བར་བྱེད་པའོ།
en: It dispels fever in the febrile, and it tames the stubborn grahas that cause all kinds of epileptic seizures. “

source: །གདོན་གྱིས་ཟིན་པ་རྣམས་ཀྱི་གདོན་དང་གཤེད་བྱེད་དང་། གདུལ་དཀའ་བ་རྣམས་འདུལ་བར་བྱེད་པའོ། །དགྲ་བོ་ཕྱིན་ཅི་ལོག་པ་རྣམས་ཀྱི་དགྲ་རྣམས་དང་བྲལ་བར་བྱེད་པའོ། །དབུལ་པོ་རྣམས་ལ་ནོར་སྦྱིན་པར་འགྱུར་རོ། །བུ་བཟའ་ཅན་རྣམས་ཀྱི་བུ་བཟའ་ཆེར་འཕེལ་བར་འགྱུར་རོ།
en: This dhāraṇī removes the enemies of those who suffer defeat, grants wealth to the poor, and causes the families of those who provide for them to thrive.

source: །མུན་པས་ལོང་བར་བྱས་པ་ཐམས་ཅད་ཀྱི་སྒྲོན་མའི་ཤིང་དང་། ཉི་མའི་འོད་ཟེར་སྟོང་གིས་ཀུན་ཏུ་སྣང་བའོ།
en: It gives the light of a torch, as bright as one thousand suns, to those who are blind.

source: །རྒྱལ་པོས་བཅོམ་པ་རྣམས་ལ་ལོངས་སྤྱོད་རྒྱ་ཆེན་པོ་ཆེར་བྱིན་པའོ། །འཁོན་པ་རྣམས་གཅིག་ཏུ་བྱེད་པའོ།
en: It gives great enjoyments to those wronged by a king and unifies those who are predisposed to hostility.

source: །སེར་སྣ་ཅན་རྣམས་ཀྱི་སེར་སྣ་ཤིན་ཏུ་འཇོམས་པའོ། །འདོད་ཆགས་ལ་ཆགས་པ་རྣམས་ཀྱི་འདོད་ཆགས་རབ་ཏུ་འཇོམས་པའོ། །རྨོངས་པ་ཆུང་བ་མ་ཡིན་པ་རྣམས་ཀྱི་རྨོངས་པ་དང་བྲལ་བར་འགྱུར་རོ།
en: It breaks the cocoon of envy in those predisposed to envy, removes desire in those inflamed by desire, and removes delusion in those suffering from delusion.

source: །མི་དགེ་བའི་ལམ་གྱིས་རབ་ཏུ་ཉམས་པ་རྣམས་ཀྱི་དགེ་བའི་ལམ་གྱི་ཡིད་ཆོས་ཀྱི་ནང་དུ་ཆུད་པར་འགྱུར་རོ། །གཞན་གྱི་དབང་དུ་གྱུར་པའི་སེམས་ཅན་རྣམས་ཀྱི་འཇིགས་པ་མེད་པར་འགྱུར་ཞིང་ཡིད་ཆོས་ཀྱི་ནང་དུ་ཆུད་པར་འགྱུར་རོ།
en: It sets the minds of those following the path of nonvirtue on the path of virtue consistent with the Dharma, grants fearlessness to those who are dependent on others, and causes their minds to turn to Dharma.

source: །ལོག་པར་ལྟུང་བ་རྣམས་ཀྱིས་ཤེས་རབ་དང་། བློ་དང་། ཤེས་བཞིན་དང་།
en: It causes intelligence and insight to arise in those who have fallen into misfortune. “

source: བརྐམ་པ་རྣམས་ཀྱི་བློ་བསྙེན་པར་འགྱུར་རོ།
en: This dhāraṇī crushes greed in the greedy, freeing them from it.

source: །སངས་རྒྱས་མ་མཐོང་བ་རྣམས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཐོང་བར་འདོད་པར་འགྱུར་རོ། །ཆོས་ཐོས་པ་དང་བྲལ་བ་རྣམས་ཀྱི། ཆོས་ཆེན་པོའི་རོ་རྒྱ་ཆེན་པོ་ཐོས་པར་འགྱུར་རོ། །དགེ་འདུན་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་བྲལ་བ་རྣམས་ཀྱི་ལྷ་དང་། ཉན་ཐོས་ཀྱི་དག་འདུན་ལ་བསྙེན་བཀུར་བྱེད་པར་འགྱུར་རོ།
en: It enables those unable to see the buddhas to see them at will, produces a steady stream of the elixir of the Dharma for those unable to hear it, and allows those who have no opportunity to serve the saṅgha to serve the celestial saṅgha of the śrāvakas.

source: །དབང་པོ་ཉམས་པ་རྣམས་ཀྱི། དབང་པོ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །ཡན་ལག་རྣམ་པར་ཉམས་པའི་སེམས་ཅན་རྣམས་ཀྱི་སོ་སོའི་ཡན་ལག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་དང་བྲལ་བ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཆེན་པོ་མཐོང་བར་འགྱུར་རོ།
en: It fully restores the senses of those with impaired sense faculties, restores the limbs and organs of those with physical disabilities, and enables those deprived of the sight of the bodhisattvas to see great numbers of them at will.

source: །ལྷས་ཡོངས་སུ་སྤངས་པ་རྣམས་ཀྱི་ལྷའི་ཚོགས་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་འཛིན་པར་འགྱུར་རོ། །ཉོན་མོངས་པ་དང་སྒྲིབ་པས་དཀྲིས་པའི་སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ།
en: It causes those who have been forsaken by the deities to be embraced by all of them, and it causes those with afflictions and obscurations to be free from them. “

source: །ཕྱག་ན་རྡོ་རྗེ་དོན་ཡོད་པའི་མཆོད་པའི་ནོར་བུའི་སྙིང་པོའི་གཟུངས་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་གསུངས་པ་ནི་དེ་ལྟར་རྫུ་འཕྲུལ་ཆེ་སྟེ།
en: Thus, O Vajrapāṇi, this heart dhāraṇī, precious amogha offerings, which was taught by Avalokiteśvara, possesses great magical power.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཆོད་པའི་སྤྲིན།
en: It conjures up masses of offerings for all tathāgatas and bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་མཆོད་པའི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་མཆོད་པའི་སྤྲིན་གྱི་ཆར་འབེབས་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་མཚུངས་པར་དུས་གསུམ་དུ་གཤེགས་ཤིང་བཞུགས་པ་རྣམས་ཀྱི་དཔག་བསམ་གྱི་ཤིང་ཆེན་པོའི་མཆོད་པའི་སྤྲིན་གྱི་ཆར་འབེབས་པར་བྱེད་པའི་མཆོད་སྤྲིན་འབྱུང་བར་འགྱུར་རོ།
en: It causes a copious rain of the seven precious jewels and masses of offerings to fall in all buddha fields, for all the tathāgatas established throughout the three times. Masses of offerings will rain down from the great wish-fulfilling tree.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ཀྱི་དམ་ཚིག་རིག་སྔགས་ཀྱི་དཀྱིལ་འཁོར་གྱི་དེ་ཁོ་ན་ཉིད་སྒྲུབ་པར་བྱེད་པ། རྨད་དུ་བྱུང་བའི་དངོས་གྲུབ་ཡང་དག་པར་སྟོན་པར་བྱེད་པའོ།
en: This dhāraṇī demonstrates the true accomplishment of the essential practice of the vidyā maṇḍala that is based on the samaya connection to all tathāgatas families.

source: །རིག་སྔགས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ལྷ་ཐམས་ཅད་དང་། རིག་པའི་རྒྱལ་པོའི་ལྷ་རྣམས་དང་། གསང་སྔགས་ཀྱི་ལྷ་ཐམས་ཅད་སྤྱན་འདྲེན་ཞིང་འགུགས་པར་བྱེད་པའོ།
en: It summons all the deities of the vidyā maṇḍala, including the kings of vidyās, and it summons and gathers all mantra deities.

source: །འདི་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །འདི་ནི་ཐམས་ཅད་དུ་གསང་བའི་སྒོ་སྟོན་པར་བྱེད་པའོ།
en: It fulfills the six perfections and reveals all secret doors. “

source: །ལག་ན་རྡོ་རྗེ་དོན་ཡོད་པའི་མཆོད་པའི་སྙིང་པོའི་གཟུངས་འདི་ནི་དུས་མ་ཡིན་པའི་ཆར་དང་། མུ་གེ་དང་། དུས་ཀྱི་ཆུ་རྣམ་པར་ཉམས་པ་ལ་སོ་སོར་བསྐྱེད་པའོ།
en: Vajrapāṇi, this heart dhāraṇī of amogha offerings can be employed at the time of drought, famine, or destructive floods.

source: །དེ་ནས་རིག་སྔགས་འཆང་གཙང་མས་ཁྲུས་བྱས་གོས་གཙང་བ་བགོས་ཏེ།
en: The vidyā holder should purify himself ritually, take a bath, and put on clean clothes.

source: ཡིད་རྩེ་གཅིག་ཏུ་བྱས་ན་སེམས་ཅན་ཐམས་ཅད་ལ་མཆོག་ཏུ་བརྩེ་བ་དང་བྱམས་པའི་སེམས་བསྒོམ་པར་བྱའོ། །མཆོད་རྟེན་གྱི་ཡན་ལག་དང་ཉེ་བའམ། ཁང་སྟོང་ངམ། རི་བོའམ། ནགས་ཐིབས་པོ་དང་། དགོན་པ་དང་།
en: Focusing his mind one-pointedly, he should cultivate thoughts of compassion and loving kindness for all beings with all his heart.

source: སྐྱེད་མོས་ཚལ་ལམ། དགེ་འདུན་གྱི་ཀུན་དགའ་ར་བའམ། ཆུ་ཀླུང་ངམ། མཚེའུའམ། རྫིང་བུའམ། ཀླུ་གནས་པའི་མཚོའམ།
en: He should find a clean spot near a caitya or at an elevated and sheltered place, on top of a mountain, in a forest thicket, in a hermitage garden, in a Buddhist monastery, by a river, lake, lotus pond, or nāga lake, in a temple, or in a royal household.

source: ལྷའི་གནས་སམ། རྒྱལ་པོའི་ཕོ་བྲང་ཡང་རུང་སྟེ། དེར་རིག་སྔགས་འཆང་གཙང་མར་གནས་པས་ས་གཞི་ཡོངས་སུ་བརྟགས་པ་ཆ་མཉམ་པ་མཛེས་པར་ཁྲུ་གཉིས་ཀྱི་ཚད་ཀྱི་དཀྱིལ་འཁོར་བྱས་ལ་ས་དང་བ་བྱུང་དུ་ལྡན་པས།
en: He should find a clean spot and carefully delimit on the ground a symmetrical area with equal sides.

source: གྲུ་བཞི་པར་ཆ་གཞལ་ཏེ།
en: Using a mixture of clay and cow dung, he should prepare a maṇḍala that is two cubits across, has four corners, and is divided into four sections.

source: ལེགས་པར་བྱི་དོར་བྱས་ལ་ཤིན་ཏུ་འཇམ་པར་བྱའོ།
en: It should be swept clean and made smooth.

source: །དེར་དེའི་སྟེང་དུ་ཙནྡན་དང་། དྲིའི་ཆུས་བྱུག་པར་བྱའོ།
en: He should daub the surface with water that has been perfumed with sandalwood and color it with saffron. “

source: །གུར་གུམ་གྱིས་རྣམ་པ་སྣ་ཚོགས་པའི་མཚན་མ་དང་ཕྱག་རྒྱ་རྣམས་རི་མོར་བྲིའོ། །དེ་ལ་དཀྱིལ་འཁོར་གྱི་དབུས་ཀྱི་སྙིང་པོ། །ཀླུ་མགོ་བོ་དགུ་པ་སྐྱིལ་མོ་ཀྲུང་གིས་འདུག་པ་བྲིའོ།
en: The vidyā holder should draw various mudrā symbols, and among them, in the center of the maṇḍala, he should draw the nāga Navaśīrṣaka sitting in a cross-legged posture.

source: །གྲྭ་བཞིའི་ནང་དུ་ཆུད་པར་དོན་ཡོད་ཞགས་པ་བྲིའོ།
en: Inside the four corners he should draw Amoghapāśa.

source: །དཀྱིལ་འཁོར་གྱི་ཕྱི་རོལ་གྱི་ཁོར་ཡུག་ཏུ་ཇི་ལྟར་ཐོབ་པའི་ཕྱག་རྒྱ་དང་། གསང་སྔགས་རྣམས་བྲི་བར་བྱའོ། །སྒོ་བཞི་རྣམ་པར་དབྱེ་བར་བྱ་སྟེ། ཇི་ལྟར་འབྱོར་པའི་གཏོར་མ་སྣ་ཚོགས་པའི་རོའི་གཏོར་མ་དཀར་པོ་དང་། མེ་ཏོག་དང་། བདུག་པ་དང་།
en: He should then surround the outside of the maṇḍala with mudrās and mantras as appropriate and carefully demarcate the four doors.

source: དྲི་དང་། མར་མེ་དང་། གང་བའི་བུམ་པ་དང་། གཏོར་མ་དང་། བདུག་པའི་པོག་ཕོར་གྱིས་ཉེ་བར་མཛེས་པར་བྱའོ།
en: Around the maṇḍala he should arrange a bali offering consisting of ‘white’ foods with various flavors as available, adding flowers, incense, fragrances, lamps, jars filled with bali articles, and incense holders. “

source: །རིག་སྔགས་འཆང་གིས་ཆེས་མངོན་དུ། དོན་ཡོད་ཞགས་པ་ལན་བདུན་བཟླས་བར་བྱའོ། །ཁྲོ་བོའི་རྒྱལ་པོ་ལ་ལན་ཅིག་བཟླས་པས་མངོན་པར་དབང་བསྐུར་བར་བྱའོ།
en: To start the recitation procedure, the vidyā holder should mindfully repeat the Amoghapāśa mantra seven times and perform the consecration with a single recitation of the Krodharāja mantra.

source: །དོན་ཡོད་པའི་ལྕགས་ཀྱུ་དང་། ཁྲོ་བོ་ལྕགས་ཀྱུ་དུས་གཅིག་ཏུ་བརྗོད་དོ། །རིག་སྔགས་ཀྱི་རྒྱལ་པོ་ལན་གསུམ་དུ་བརྗོད་པར་བྱའོ།
en: He should then mindfully repeat the Amoghāṅkuśa and the Krodhāṅkuśa mantras one time each, and the king of vidyās three times.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་དཀྱིལ་འཁོར་ལ་མངོན་དུ་ཕྱོགས་ཏེ་བཟླས་པའི་ཆོ་ག་བྱའོ། །དོན་ཡོད་པའི་མཆོད་པ་ནོར་བུའི་སྙིང་པོ་ལན་སྟོང་རྩ་བརྒྱད་དུ་བཟླས་བརྗོད་བྱའོ། །ནཱ་ག་གེ་སར་དང་། ན་ལ་དི་ན་དང་། རྒྱ་སྤོས་དང་། གུར་གུམ་དང་།
en: Then, facing the maṇḍala, the vidyā holder should commence the main recitation procedure by reciting the heart dhāraṇī of precious amogha offerings one thousand and eight times.

source: ཙནྡན་དང་། ཡུངས་ཀར་དང་། ལི་ཁ་ར་མཉམ་པར་སྦྱར་བའི་བདུག་པ་ལ་བཟླས་བརྗོད་བརྒྱ་རྩ་བརྒྱད་བྱ་སྟེ། ཀླུའི་དཀྱིལ་འཁོར་དུ་བདུག་པ་དབུལ་བར་བྱའོ། །ཀླུའི་ལྟེ་བའི་སྟེང་དུ་བདུག་སྤོས་ཀྱི་པོག་ཕོར་གང་བ་གཞག་པར་བྱའོ།
en: He should incant incense of nāgapuṣpa, nalada, tagara, bdellium, and sandalwood combined with mustard seeds and granulated sugar, one hundred and eight times, and place it in an incense holder upon the belly of the nāga inside the nāga maṇḍala. “

source: །ལན་སྟོང་རྩ་བརྒྱད་དུ་བཟླས་པའི་མོད་ཉིད་ལ། ཀླུའི་ཞགས་པ་ཆེན་པོ་ལས་ཆར་གྱི་རྒྱུན་ཆེན་པོ་འབྱིན་ཏེ་ཇི་སྲིད་འདོད་པའི་བར་དུ་ཆར་འབེབས་སོ།
en: When the vidyā holder has completed one thousand and eight recitations, the great Nāgapāśa will release torrents of rain, which will continue for as long as the vidyā holder wishes.

source: །ཀླུའི་རྒྱལ་པོའི་མིང་ནས་བཟུང་སྟེ་བཟླས་པར་བྱའོ། །ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་དང་། དགའ་བོ་དང་། ཉེ་དགའ་བོ་དང་།
en: He should then call the names of the nāga kings and recite the mantra.

source: ནོར་རྒྱས་ཀྱི་བུ་དང་། འཇོག་པོ་དང་། ཧུ་ལུ་དང་། ཨུ་ལ་མ་བུ་ལ་དང་། ཆུ་ལྷ་དང་། ཡིད་ལྡན་དང་། ཨེ་ལའི་འདབ་མ་དང་།
en: The names of the nāga kings are Sāgara, Nandopananda, Vāsuki, Takṣaka, Huluḍa, Lāmbura, Varuṇa, Manasvin, Elapatra, and Samantaparikarachattra.

source: ཀླུའི་རྒྱལ་པོ་ཀུན་ནས་འཁོར་བའི་གདུགས་ཏེ། ཀླུའི་རྒྱལ་པོ་རྣམས་ལས་ཅིག་སྨོས་པར་བྱ་སྟེ།
en: The vidyā holder should call any of these nāga kings, and, bound by oath, they will instantly release torrents of rain.

source: ཀླུའི་རྒྱལ་པོ་དེ་རྣམས་ཀྱི་བདེན་པར་དམ་བཅས་པས་རྣམ་པར་གཞག་པའི་མོད་ཉིད་ལ་ཆར་གྱི་རྒྱུན་འབྱིན་པར་བྱེད་དེ་ཇི་སྲིད་འདོད་ཀྱི་བར་དུ་ཀུན་ནས་སྦྱོར་བས་ཆར་སྟོང་ཕྲག་འབེབས་སོ།
en: The rain will fall within the radius of one league for as long as the vidyā holder wishes. “

source: །ཡང་ན། ཡུངས་ཀར་ལ་སྟོང་རྩ་བརྒྱད་དུ་བཟླས་པས། ཀླུའི་རྒྱལ་པོའི་སྙིང་གའི་སྟེང་དུ་སྦྱིན་སྲེག་བྱའོ།
en: Optionally, the vidyā holder should incant mustard seeds one thousand and eight times and offer them as homa upon the heart of the nāga king.

source: །སྦྱིན་སྲེག་བྱས་པ་ཙམ་གྱི་མོད་ལ་འཕྲལ་ཉིད་དུ་སྟོང་ཕྲག་དུ་མར་ཨ་བི་རཱ་ཡ་ཆར་གྱི་རྒྱུན་འབྱིན་པར་བྱེད་དོ།
en: The very instant the homa is offered, torrents of rain will fall, enough to fill a thousand cisterns.

source: །སྤར་མོ་གང་གིས་ཉིན་མཚན་གཅིག་ཏུ་རྒྱུན་མི་འཆད་པར་ཆར་འབེབས་སོ།
en: If the vidyā holder offers one handful of seeds, the rain will fall incessantly for one day and one night.

source: །སྦར་མོ་གསུམ་གྱིས་ཉིན་མཚན་གསུམ་དུ་འབེབས་སོ།
en: If he offers two handfuls, it will rain three days and three nights.

source: །སྤར་མོ་བདུན་གྱིས་ཉིན་མཚན་བདུན་དུ་ཆར་གྱི་རྒྱུན་ཆེན་པོ་ཀླུའི་རྒྱལ་པོས་འབྱིན་པར་བྱེད་དོ།
en: If he offers three handfuls, the great nāga kings will send torrents of rain for seven days and seven nights.

source: །ཡང་དག་པ་ཁོ་ནར་ཆར་གྱི་རྒྱུན་ལྟུང་ངོ་།
en: It will rain exactly as much as required. “

source: །ཡང་ན། ཀླུའི་རས་རིས་བྱ་སྟེ། ཁྲུ་གང་གི་ཚད་ལ་ཀུན་ནས་གྲུ་བཞི་པའི་ཚད་ཀྱི་རས་ལ་རི་མོར་བྱའོ།
en: Alternatively, the vidyā holder should prepare, on a square canvas made of fine cotton, a cloth painting of the nāga that is one cubit across.

source: །དེའི་དབུས་སུ་རིག་པའི་རྒྱལ་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བྲི་བར་བྱ་སྟེ། སྐྱིལ་མོ་ཀྲུང་གིས་འདུག་པ།
en: The vidyā holder should draw Noble Avalokiteśvara Vidyārāja in the center, sitting in a cross-legged posture.

source: ཕྱག་བཞི་པ། རལ་གྲི་དང་། རྩེ་གསུམ་དང་། ཞགས་པ་དང་། པདྨ་ཐོགས་པར་བྱའོ།
en: In his four hands he holds a sword, trident, noose, and lotus.

source: །ཞལ་ཁྲོ་གཉེར་ཅན་རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ། རལ་པའི་ཅོད་པན་གྱིས་སྤུད་པ།
en: He should be depicted with a frowning face, adorned with all ornaments, and with a diadem atop his matted hair.

source: འོད་དཔག་མེད་ཀྱི་ཅོད་པན་ཅན་རལ་པ་ཟླ་བ་ཕྱེད་པས་ཉེ་བར་མཛེས་པ། འོད་འདོམ་གང་བས་ཡང་དག་པར་བརྒྱན་པ།
en: His crest jewel is Amitābha, and his hair is adorned with a crescent moon.

source: ཆུ་དང་བཅས་པའི་པདྨའི་གདན་བྱའོ།
en: He has a halo one fathom wide, and he sits on a lotus in the middle of a lotus pond.
